       01  TRMAP-REC.
           05  TID   PIC X(12).
           05  BUID  PIC X(4).
           05  ASCD  PIC X(5).
           05  SDR   PIC X.
           05  QTY   PIC 9(7).
           05  PXO   PIC 9(5)V999.
           05  PXC   PIC 9(5)V999.
           05  RSK   PIC X.
